FROM node:16-alpine

WORKDIR /app
# 컨테이너 안에서 어떤 경로에 실행을 할지 명시를 해주어야 한다.
# 루트 경로의 app 이라는 경로 안에 관련된 파일들을 카피해서 오겠다는 의미이다. 

COPY package.json package-lock.json ./

RUN npm ci
# 노드가 아닌 다른 환경에서 docker 를 실행하고 싶다면, ci 를 추천한다. ci는 우리가 사용했던 버전 package-lock 에 명시되어 있던 3.1 버전과 같은 버전을 설치를 하게 된다.

# 하지만 install은 그에 업데이트 되어 버전이 5가 되었다면 5의 버전을 설치하기 때문에 오류가 발생할 수 있다 [버전 충돌]

COPY index.js .

ENTRYPOINT [ "node", "index.js" ]
# node를 실행할 거도 index.js 를 실행할 것이다 라는 의미이다. 

# 이렇게 도커 파일은 [레이어 형태] 로 만들어 주는 것이 좋은데
# 이는 제일 빈번히 발새하는 것일 수록 제일 마지막에 작성해야 한다.
# 명령어 하나하나가 레이어로 되어 있어서 배치를 하게 되면 가장 빈번하게 변경이 되는 것이 맨 위에 배치가 되기 때문에, 이미지를 만들고 소스파일이 변경이 되었을 때 위에 부분만 변경이 되고 나머지 밑에 부분은 변경이 되지 않기 때문에 불필요한 일을 하지 않게 된다.  

# 이미지 만드는 시간 단축, 호율성 증가.